# Lab | Advanced SQL - SOLUTIONS

## Introduction

In this lab you will practice SQL Subqueries and Action Queries. We will again use the publications database, used in the past lab.

## Challenge 1 - Most Profiting Authors

In this challenge let's have a close look at the bonus challenge of the previous *SQL SELECT* lab -- **who are the top 3 most profiting authors**? Even if you have solved or think you have solved that problem in the previous lab, please still complete this challenge because the step-by-step guidances are helpful to train your problem-solving thinking.

In order to solve this problem, it is important for you to keep the following points in mind:

* In table `sales`, a title can appear several times. The royalties need to be calculated for each sale.

* Despite a title can have multiple `sales` records, the advance must be calculated only once for each title.

* In your eventual solution, you need to sum up the following profits for each individual author:
    * All advances which is calculated exactly once for each title.
    * All royalties in each sale.

Therefore, you will not be able to achieve the goal with a single SELECT query. Instead, you will need to follow several steps in order to achieve the eventual solution. Below is an overview of the steps:

1. Calculate the royalty of each sale for each author.

1. Using the output from Step 1 as a sub-table, aggregate the total royalties for each title for each author.

1. Using the output from Step 2 as a sub-table, calculate the total profits of each author by aggregating the advances and total royalties of each title.

Below we'll guide you through each step. In your `solutions.ipynb`, please include the SELECT queries of each step so that your TA can review your problem-solving process.

### Step 1: Calculate the royalties of each sales for each author

Write a SELECT query to obtain the following output:

* Title ID
* Author ID
* Royalty of each sale for each author
    * The formula is:
        ```
        sales_royalty = titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100
        ```
    * Note that `titles.royalty` and `titleauthor.royaltyper` are divided by 100 respectively because they are percentage numbers instead of floats.

In the output of this step, each title may appear more than once for each author. This is because a title can have more than one sales.

#### Load the extension

In [11]:
%load_ext sql

#### Connect to the database

In [12]:
%sql sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db

#### Get list of tables

In [13]:
%config SqlMagic.style="ALL"

#### Start challenge

In [ ]:
#check sales table

In [17]:
%%sql
select *
from sales
limit 3

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('6380', '6871', '1994-09-14 00:00:00', 5, 'Net 60', 'BU1032'),
 ('6380', '722a', '1994-09-13 00:00:00', 3, 'Net 60', 'PS2091'),
 ('7066', 'A2976', '1993-05-24 00:00:00', 50, 'Net 30', 'PC8888')]

In [18]:
#select: Title ID + Author ID +Royalty of each sale for each autho

In [33]:
%%sql
select titles.title_id as "TITLE ID", 
        authors.au_id as "AUTHOR ID",
        titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as "SALES ROYALTY"

from titles join titleauthor on titles.title_id = titleauthor.title_id
             join authors on titleauthor.au_id = authors.au_id
             join sales on titles.title_id = sales.title_id

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('PS3333', '172-32-1176', 29.984999999999996),
 ('BU1032', '213-46-8915', 3.9979999999999993),
 ('BU1032', '213-46-8915', 7.995999999999999),
 ('BU2075', '213-46-8915', 25.116000000000003),
 ('PC1035', '238-95-7766', 110.16),
 ('BU1111', '267-41-2394', 11.95),
 ('TC7777', '267-41-2394', 8.994),
 ('BU7832', '274-80-9391', 29.984999999999996),
 ('BU1032', '409-56-7008', 5.996999999999999),
 ('BU1032', '409-56-7008', 11.993999999999998),
 ('PC8888', '427-17-2319', 50),
 ('TC7777', '472-27-2349', 8.994),
 ('PS7777', '486-29-1786', 19.975),
 ('TC4203', '648-92-1872', 33.46),
 ('TC7777', '672-71-3249', 11.992),
 ('MC2222', '712-45-1867', 23.987999999999996),
 ('MC3021', '722-51-5454', 13.455),
 ('MC3021', '722-51-5454', 8.073),
 ('BU1111', '724-80-9391', 17.925),
 ('PS1372', '724-80-9391', 10.795),
 ('PS1372', '756-30-7391', 32.385),
 ('TC3218', '807-91-6654', 83.8),
 ('PC8888', '846-92-7186', 50),
 ('MC3021', '899-46-2035', 4.485),
 ('MC3021', '899-46-2035', 2.6910000000000003),
 ('PS2091', '899-46-2035', 1.9709999999999996),
 ('PS2091', '899-46-2035', 49.275),
 ('PS2091', '899-46-2035', 6.57),
 ('PS2091', '899-46-2035', 13.14),
 ('PS2091', '998-72-3567', 1.9709999999999996),
 ('PS2091', '998-72-3567', 49.275),
 ('PS2091', '998-72-3567', 6.57),
 ('PS2091', '998-72-3567', 13.14),
 ('PS2106', '998-72-3567', 17)]

### Step 2: Aggregate the total royalties for each title for each author

Using the output from Step 1, write a query to obtain the following output:

* Title ID
* Author ID
* Aggregated royalties of each title for each author
    * Hint: use the *SUM* subquery and group by both `au_id` and `title_id`

In the output of this step, each title should appear only once for each author.

In [40]:
%%sql
select titles.title_id as "TITLE ID", 
        authors.au_id as "AUTHOR ID",
        sum(titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) as "SUM SALES ROYALTY"
        

from titles join titleauthor on titles.title_id = titleauthor.title_id
             join authors on titleauthor.au_id = authors.au_id
             join sales on titles.title_id = sales.title_id
        
group by authors.au_id, titles.title_id

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('PS3333', '172-32-1176', 29.984999999999996),
 ('BU1032', '213-46-8915', 11.993999999999998),
 ('BU2075', '213-46-8915', 25.116000000000003),
 ('PC1035', '238-95-7766', 110.16),
 ('BU1111', '267-41-2394', 11.95),
 ('TC7777', '267-41-2394', 8.994),
 ('BU7832', '274-80-9391', 29.984999999999996),
 ('BU1032', '409-56-7008', 17.990999999999996),
 ('PC8888', '427-17-2319', 50),
 ('TC7777', '472-27-2349', 8.994),
 ('PS7777', '486-29-1786', 19.975),
 ('TC4203', '648-92-1872', 33.46),
 ('TC7777', '672-71-3249', 11.992),
 ('MC2222', '712-45-1867', 23.987999999999996),
 ('MC3021', '722-51-5454', 21.528),
 ('BU1111', '724-80-9391', 17.925),
 ('PS1372', '724-80-9391', 10.795),
 ('PS1372', '756-30-7391', 32.385),
 ('TC3218', '807-91-6654', 83.8),
 ('PC8888', '846-92-7186', 50),
 ('MC3021', '899-46-2035', 7.176),
 ('PS2091', '899-46-2035', 70.95599999999999),
 ('PS2091', '998-72-3567', 70.95599999999999),
 ('PS2106', '998-72-3567', 17)]

### Step 3: Calculate the total profits of each author

Now that each title has exactly one row for each author where the advance and royalties are available, we are ready to obtain the eventual output. Using the output from Step 2, write a query to obtain the following output:

* Author ID
* Profits of each author by aggregating the advance and total royalties of each title

Sort the output based on a total profits from high to low, and limit the number of rows to 3.

In [45]:
%%sql
select *
from titles
limit 2

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00'),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', 'business', '1389', 11.95, 5000, 10, 3876, 'Helpful hints on how to use your electronic resources to the best advantage.', '1991-06-09 00:00:00')]

In [47]:
%%sql
select titles.title_id as "TITLE ID", 
        authors.au_id as "AUTHOR ID",
        sum(titles.advance)+
        sum(titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) as "PROFIT/AUTHOR" 
        

from titles join titleauthor on titles.title_id = titleauthor.title_id
             join authors on titleauthor.au_id = authors.au_id
             join sales on titles.title_id = sales.title_id 
        
group by authors.au_id
order by "PROFIT/AUTHOR" desc
limit 3

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('MC3021', '899-46-2035', 39178.132),
 ('MC3021', '722-51-5454', 30021.528),
 ('BU1032', '213-46-8915', 20162.11)]

## Challenge 2

Elevating from your solution in Challenge 1 , create a table named `most_profiting_authors` to hold the data about the most profiting authors. The table should have 2 columns:

* `au_id` - Author ID
* `profits` - The profits of the author aggregating the advances and royalties

Include your solution in `solutions.ipynb`.

In [55]:
%%sql
create table most_profiting_authors as
select  authors.au_id as "AUTHOR ID",
        sum(titles.advance)+
        sum(titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) as "PROFIT/AUTHOR" 
        

from titles join titleauthor on titles.title_id = titleauthor.title_id
             join authors on titleauthor.au_id = authors.au_id
             join sales on titles.title_id = sales.title_id 
        
group by authors.au_id
order by "PROFIT/AUTHOR" desc
limit 3

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[]

In [56]:
%%sql
select *
from most_profiting_authors

 * sqlite:////Users/annavilardell/Desktop/BootcampData/20-lab-sql-select/publications.db
Done.

[('899-46-2035', 39178.132),
 ('722-51-5454', 30021.528),
 ('213-46-8915', 20162.11)]